In [1]:
# derste aldığım notlar

import numpy as np
import pandas as pd

In [2]:
sozlukVerisi= {"Istanbul" : [30,29,np.nan], "Ankara" : [20, np.nan,25], "Izmir" : [40,39,38] }
havaDurumuDataFrame= pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame #yukarıdaki np.nan olanlar eksik veri

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna() #içinde nan olan veri olan satır kısımlar düşürücek

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis=1) # nan olmayan sütunları getirme

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri = {"Istanbul" : [30,29,np.nan], "Ankara" : [20, np.nan,25],  "Izmir" : [40,39,38], "Antalya": [45, np.nan, np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [7]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [8]:
yeniDataFrame.dropna(axis=1,thresh=2) #2 ve üzeri nan olan sütunları atıyor gerisini göseriyor

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
yeniDataFrame.fillna(20) # bos olanların hepsine 20 getiriyor

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupby

In [10]:
maasSozlugu = { "Departmanlar" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"] ,
               "Calısan ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maas" : [100,150,200,300,400,500]
              }

In [11]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [12]:
maasDataFrame

  Departmanlar Calısan ismi  Maas
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Atil   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [13]:
groupObjesi = maasDataFrame.groupby("Departmanlar")

In [14]:
groupObjesi.count() # hangi alanda kaç kişi çalışıyor

              Calısan ismi  Maas
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [15]:
groupObjesi.mean("Maas")

               Maas
Departmanlar
Hukuk         450.0
Pazarlama     250.0
Yazılım       125.0

In [16]:
groupObjesi.min()

             Calısan ismi  Maas
Departmanlar
Hukuk               Fatma   400
Pazarlama            Atil   200
Yazılım             Ahmet   100

In [17]:
groupObjesi.max()

             Calısan ismi  Maas
Departmanlar
Hukuk              Zeynep   500
Pazarlama           Burak   300
Yazılım            Mehmet   150

In [18]:
groupObjesi.describe()

              Maas
             count   mean        std    min    25%    50%    75%    max
Departmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0